пендосские_буквы1 = \
' * **  * ** ****** *** **** *** **  * ** ************  ****** ** ** ** ** ****'
пендосские_буквы2 = \
'* ** ** ** **  *  *  * * *   *** *  ******* ** ** ** **   * * ** ** ** ** *  *'
пендосские_буквы3 = \
'***** *  * *** ** * **** *   **  *  ******* ***** ***  *  * * ** ** * * * * *'
пендосские_буквы4 = \
'* ** ** ** **  *  * ** * * * *** *  **** ** **  **** *  * * * ** ***** * * *'
пендосские_буквы5 = \
'* ***  * ** ****   *** **** * * ***** ** *****  **** ***  * *** * * ** * * ***'

"""Строки взяты из 13.6, два пробела между буквами удалены"""
l1 = ""
l2 = ""
l3 = ""
l4 = ""
l5 = ""

for letter in input():
    letter = letter.lower()
    i = ord(letter) % 97 # ASCII
    l1 += пендосские_буквы1[i*3]+пендосские_буквы1[i*3+1]+пендосские_буквы1[i*3+2]
    l2 += пендосские_буквы2[i*3]+пендосские_буквы2[i*3+1]+пендосские_буквы2[i*3+2]
    l3 += пендосские_буквы3[i*3]+пендосские_буквы3[i*3+1]+пендосские_буквы3[i*3+2]
    l4 += пендосские_буквы4[i*3]+пендосские_буквы4[i*3+1]+пендосские_буквы4[i*3+2]
    l5 += пендосские_буквы5[i*3]+пендосские_буквы5[i*3+1]+пендосские_буквы5[i*3+2]

print(l1)
print(l2)
print(l3)
print(l4)
print(l5)

